# Panda Excercises

In [3]:
import pandas as pd

# 1. How to import pandas and check the version?

In [11]:
import pandas as pd

print("Versions: ", pd.__version__)
print(pd.show_versions(as_json=True))

Versions:  2.2.3
{
  "system": {
    "commit": "0691c5cf90477d3503834d983f69350f250a6ff7",
    "python": "3.10.12",
    "python-bits": 64,
    "OS": "Linux",
    "OS-release": "6.8.0-59-generic",
    "Version": "#61~22.04.1-Ubuntu SMP PREEMPT_DYNAMIC Tue Apr 15 17:03:15 UTC 2",
    "machine": "x86_64",
    "processor": "x86_64",
    "byteorder": "little",
    "LC_ALL": null,
    "LANG": "en_ZA.UTF-8",
    "LOCALE": {
      "language-code": "en_ZA",
      "encoding": "UTF-8"
    }
  },
  "dependencies": {
    "pandas": "2.2.3",
    "numpy": "2.2.5",
    "pytz": "2025.2",
    "dateutil": "2.9.0.post0",
    "pip": "22.0.2",
    "Cython": null,
    "sphinx": null,
    "IPython": "8.36.0",
    "adbc-driver-postgresql": null,
    "adbc-driver-sqlite": null,
    "bs4": "4.13.4",
    "blosc": null,
    "bottleneck": null,
    "dataframe-api-compat": null,
    "fastparquet": null,
    "fsspec": null,
    "html5lib": null,
    "hypothesis": null,
    "gcsfs": null,
    "jinja2": "3.1.6",
    "lxml.etree": null,
    "matplotlib": null,
    "numba": null,
    "numexpr": null,
    "odfpy": null,
    "openpyxl": null,
    "pandas_gbq": null,
    "psycopg2": null,
    "pymysql": null,
    "pyarrow": "20.0.0",
    "pyreadstat": null,
    "pytest": null,
    "python-calamine": null,
    "pyxlsb": null,
    "s3fs": null,
    "scipy": null,
    "sqlalchemy": null,
    "tables": null,
    "tabulate": null,
    "xarray": null,
    "xlrd": null,
    "xlsxwriter": null,
    "zstandard": null,
    "tzdata": "2025.2",
    "qtpy": null,
    "pyqt5": null
  }
}None

# 2. How to create a series from a list, numpy array and dict? 
Create a pandas series from each of the items below: a list, numpy and a dictionary

Input

```
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr)

In [13]:
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

In [20]:
df = pd.Series(mylist)
df = pd.Series(myarr)
df = pd.Series(mydict)
df

a     0
b     1
c     2
e     3
d     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
u    20
v    21
w    22
x    23
y    24
z    25
dtype: int64

# 3. How to convert the index of a series into a column of a dataframe?
Difficulty Level: L1

Convert the series ser into a dataframe with its index as another column on the dataframe.

Input
```
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)

In [27]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)

In [29]:
df = ser.to_frame()
df

    0
a   0
b   1
c   2
e   3
d   4
f   5
g   6
h   7
i   8
j   9
k  10
l  11
m  12
n  13
o  14
p  15
q  16
r  17
s  18
t  19
u  20
v  21
w  22
x  23
y  24
z  25

In [28]:
# Solution
df = ser.to_frame().reset_index()
print(df.head())

  index  0
0     a  0
1     b  1
2     c  2
3     e  3
4     d  4

# 4. How to combine many series to form a dataframe?
Difficulty Level: L1

Combine ser1 and ser2 to form a dataframe.

Input

```
import numpy as np
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [32]:
import numpy as np
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [47]:
df = pd.concat([ser1, ser2], axis=1)
df.head(3)

   0  1
0  a  0
1  b  1
2  c  2

In [48]:
df = pd.DataFrame({'col1': ser1, 'col2':ser2})

In [49]:
df.head()

  col1  col2
0    a     0
1    b     1
2    c     2
3    e     3
4    d     4

# 5. How to assign name to the series’ index?
Difficulty Level: L1

Give a name to the series ser calling it ‘alphabets’.

Input
```
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

In [50]:
ser.name = "alphabets"

In [51]:
ser.head()

a    0
b    1
c    2
e    3
d    4
Name: alphabets, dtype: int64

# 6. How to get the items of series A not present in series B?
Difficulty Level: L2

From ser1 remove items present in ser2.
```
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [54]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])
ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
dtype: int64

# 7. How to get the items not common to both series A and series B?
Difficulty Level: L2

Get all items of ser1 and ser2 not common to both.

Input
```
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [60]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

ser_u = pd.Series(np.union1d(ser1,ser2))

ser_i = pd.Series(np.intersect1d(ser1,ser2))

ser_u[~ser_u.isin(ser_i)]

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

# 8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?
Difficuty Level: L2

Compute the minimum, 25th percentile, median, 75th, and maximum of ser.

Input
```
ser = pd.Series(np.random.normal(10, 5, 25))

In [62]:
ser = pd.Series(np.random.normal(10, 5, 25))
ser.describe()

count    25.000000
mean      9.765796
std       6.372094
min      -2.567082
25%       6.582266
50%       8.882776
75%      13.955394
max      22.557326
dtype: float64

In [63]:
np.percentile(ser, q=[0, 25, 50, 75, 100])

array([-2.56708151,  6.58226648,  8.88277576, 13.95539354, 22.55732566])